
recipe_start = """
В таком случае, я предложу вам свой фирменный рецепт! 
Я называю это тосты по-итальянски, одно из моих любимых блюд🤩

Показать?
"""

recipe = """

Вот что вам понадобится для их приготовления...

ИНГРЕДИЕНТЫ:

Хлеб для тостов – 4 ломтика
Спелый банан – 1 шт.
Сыр моцарелла – 100 г (лучше взять в качестве)
Сливочное масло – 2-3 ст. ложки
Мёд (по желанию) – для подачи
Корица (по желанию) – для посыпки

ПОШАГОВЫЙ РЕЦЕПТ:

1. Подготовка ингредиентов:
- Банан очисти от кожуры и нарежь кружочками.
- Сыр моцареллу нарежь тонкими пластинами или натри на крупной терке.

2. Сборка тостов:
- Возьми два ломтика хлеба, на один выложи слой моцареллы, сверху распредели банановые кружочки и накрой вторым ломтиком хлеба.
- При необходимости добавь второй слой моцареллы на бананы, чтобы тосты получились ещё более сырными.

3. Обжарка тостов:
- Разогрей сковороду на среднем огне.
- Расплавь в сковороде сливочное масло.
- Аккуратно выложи тосты на сковороду и обжаривай их до золотистой корочки с обеих сторон (по приблизительно 2-3 минуты на сторону).

4. Подача блюда:
- Готовые тосты переложи на бумажные полотенца, чтобы удалить лишний жир.
- Если хочешь, можешь добавить немного мёда и посыпать тост корицей для дополнительной сладости и аромата.
- Тосты готовы к подаче – порежь их на половинки или четвертинки и подавай к завтраку или в качестве перекуса.

Приятного аппетита!
"""

feedback_text = """

❗️ Если вы обнаружили неполадки:

- Проблемы с генерацией рецептов
- Неудобное ипользование
- Или у вас есть идеи для улучшения бота

<b>ПОЖАЛУЙСТА</b> укажите это.


"""

menu_text = """
👨‍🍳 Давайте что-нибудь приотовим! 

<b>1.</b> Найти рецепт блюда по названию
<b>2.</b> Подобрать рецепт по предпочтениям
<b>3.</b> Подобрать рецепт по ингредиентам
<b>4.</b> Поддержать проект 💸
    
"""


about_info = """
Поехали! Много-много лет я провел, изучая исскуство кулинарии.
Теперь я готов поделиться с вами своим опытом!

Вот что я могу сделать:

🔠 ПРЕДОСТАВИТЬ ВАМ РЕЦЕПТ БЛЮДА ПО НАЗВАНИЮ
Вы вводите название блюда, я выдаю вам список необходимых ингредиентов и пошаговую инструкцию приготовления

💛 ПОДОБРАТЬ СЛУЧАЙНЫЙ РЕЦЕПТ ПО ВАШИМ ВКУСОВЫМ ПРЕДПОЧТЕНИЯМ
Вы указываете ваши пожелания (например, 'Хочу дессерт с бананом и шоколадом'), а я нахожу рецепт, выдаю вам список необходимых ингридиентов и пошаговую инструкцию приготовления

🥩 ПОДОБРАТЬ РЕЦЕПТ ПО ИНГРЕДИЕНТАМ, КОТОРЫЕ У ВАС ЕСТЬ В ХОЛОДИЛЬНИКЕ
Вы указываете список доступных вам ингредиентов, а я придумываю рецепт и выдаю вам пошаговую инструкцию приготовления

🧠 ВАЖНО! Я спроектирован на основе генеративного исскуственного интеллекта (GPT)
Поэтому прошу ипользовать корректные имена ингредиентов и рецептов, чтобы я понял вас.

🤖 P.S. Я все еще нахожусь в состоянии разработки, так что возможны неполадки в работе, особенно в процессе генерации рецептов
"""